INSERT INTO sutk.departments (name, phone, email)
VALUES
    ('Отдел продаж', '+7(111)111-11-22', 'sales@example.com'),
    ('Отдел маркетинга', '+7(222)222-22-22', 'marketing@example.com'),
    ('Отдел разработки', '+7(333)333-33-33', 'development@example.com'),
    ('Отдел поддержки', '+7(444)444-44-44', 'support@example.com'),
    ('Отдел качества', '+7(555)555-55-55', 'quality@example.com');

INSERT INTO sutk.workers (department_id, name, surname, middle_name)
VALUES
    (1, 'Иван', 'Иванов', 'Иванович'),
    (2, 'Петр', 'Петров', NULL),
    (3, 'Анна', 'Сидорова', 'Александровна'),
    (4, 'Елена', 'Козлова', 'Викторовна'),
    (5, 'Сергей', 'Морозов', 'Игоревич'),
    (1, 'Мария', 'Попова', 'Сергеевна'),
    (2, 'Алексей', 'Никитин', 'Дмитриевич'),
    (3, 'Ольга', 'Кузнецова', 'Андреевна'),
    (4, 'Дмитрий', 'Соколов', 'Павлович'),
    (5, 'Екатерина', 'Иванова', 'Юрьевна'),
    (1, 'Александра', 'Федорова', NULL),
    (2, 'Григорий', 'Белов', 'Игнатьевич'),
    (3, 'Андрей', 'Крылов', 'Владимирович'),
    (4, 'Наталья', 'Андреева', 'Васильевна'),
    (5, 'Артем', 'Поляков', NULL),
    (1, 'Светлана', 'Максимова', 'Алексеевна'),
    (2, 'Игорь', 'Филиппов', 'Сергеевич'),
    (3, 'Татьяна', 'Лебедева', 'Петровна'),
    (4, 'Алексей', 'Григорьев', 'Евгеньевич'),
    (5, 'Марина', 'Давыдова', 'Ильинична');

INSERT INTO sutk.clients (worker_id, company, contact_name, phone)
VALUES
    (2, 'Компания ABC', 'Иван Иванов', '+7(111)222-33-44'),
    (2, 'OOO "XYZ"', 'Елена Смирнова', '+7(222)333-44-55'),
    (10, '123 Инк.', 'Александр Петров', '+7(333)444-55-66'),
    (4, 'Смит и Ко.', 'Ольга Белова', '+7(444)555-66-77'),
    (5, NULL, 'Мария Васильева', '+7(555)666-77-88'),
    (1, 'Технологические Решения', 'Дмитрий Соколов', '+7(111)222-33-45'),
    (11, 'Глобальные Инновации', 'Анна Иванова', '+7(222)333-44-56'),
    (3, NULL, 'Кирилл Михайлов', '+7(333)444-55-67'),
    (4, 'Яркое Будущее', 'Татьяна Егорова', '+7(444)555-66-78'),
    (3, 'Корпорация Видение', 'Алексей Федоров', '+7(555)666-77-89'),
    (1, 'Умные Технологии', 'Наталья Попова', '+7(111)222-33-46'),
    (11, NULL, 'Роман Волков', '+7(222)333-44-57'),
    (3, NULL, 'Виктория Сергеева', '+7(333)444-55-68'),
    (4, 'Золотые Врата', 'Игорь Васильев', '+7(444)555-66-79'),
    (14, 'Динамичные Дизайны', 'Алёна Петрова', '+7(555)666-77-90'),
    (1, NULL, 'Павел Лебедев', '+7(111)222-33-47'),
    (2, NULL, 'Светлана Козлова', '+7(222)333-44-58'),
    (9, 'Будущие Технологии', 'Максим Степанов', '+7(333)444-55-69'),
    (4, 'ТехПро', 'Юлия Николаева', '+7(444)555-66-80');

INSERT INTO sutk.addresses (client_id, address, from_date, to_date)
VALUES
    (1, 'First Address for User 1', '2024-03-25 10:00:00', '2024-03-26 15:30:00'),
    (1, 'Second Address for User 1', '2024-03-26 15:30:00', '2024-03-27 09:45:00'),
    (1, 'Third Address for User 1', '2024-03-27 09:45:00', NULL),
    (3, 'First Address for User 3', '2024-03-25 08:00:00', '2024-03-26 11:45:00'),
    (3, 'Second Address for User 3', '2024-03-26 11:45:00', '2024-03-30 14:20:00'),
    (3, 'Third Address for User 3', '2024-03-30 14:20:00', NULL),
    (5, 'First Address for User 5', '2024-03-26 09:30:00', '2024-03-28 12:15:00'),
    (5, 'Second Address for User 5', '2024-03-28 12:15:00', '2024-04-02 16:40:00'),
    (5, 'Third Address for User 5', '2024-04-02 16:40:00', NULL),
    (7, 'First Address for User 7', '2024-03-27 11:20:00', '2024-03-28 13:50:00'),
    (7, 'Second Address for User 7', '2024-03-28 13:50:00', '2024-04-05 17:10:00'),
    (7, 'Third Address for User 7', '2024-04-05 17:10:00', NULL),
    (9, 'First Address for User 9', '2024-03-28 10:10:00', '2024-03-29 14:00:00'),
    (9, 'Second Address for User 9', '2024-03-29 14:00:00', '2024-04-03 16:45:00'),
    (9, 'Third Address for User 9', '2024-04-03 16:45:00', NULL),
    (11, 'First Address for User 11', '2024-03-28 10:10:00', '2024-03-29 15:00:00'),
    (11, 'Second Address for User 11', '2024-03-29 14:00:00', '2024-04-03 17:45:00'),
    (11, 'Third Address for User 11', '2024-04-03 16:45:00', NULL),
    (13, 'First Address for User 13', '2024-03-28 10:10:00', '2024-03-25 16:00:00'),
    (13, 'Second Address for User 13', '2024-03-29 14:00:00', '2024-04-03 18:45:00'),
    (13, 'Third Address for User 13', '2024-04-03 16:45:00', NULL),
    (15, 'First Address for User 15', '2024-03-28 10:10:00', '2024-03-29 17:00:00'),
    (15, 'Second Address for User 15', '2024-03-29 14:00:00', '2024-04-03 19:45:00'),
    (15, 'Third Address for User 15', '2024-04-03 16:45:00', NULL),
    (17, 'First Address for User 17', '2024-03-28 10:10:00', '2024-03-28 18:00:00'),
    (17, 'Second Address for User 17', '2024-03-29 14:00:00', '2024-04-03 20:45:00'),
    (17, 'Third Address for User 17', '2024-04-03 16:45:00', NULL),
    (19, 'First Address for User 19', '2024-03-28 10:10:00', '2024-03-30 19:00:00'),
    (19, 'Second Address for User 19', '2024-03-29 14:00:00', '2024-04-03 21:45:00'),
    (19, 'Third Address for User 19', '2024-04-03 16:45:00', NULL);

INSERT INTO sutk.orders (client_id, description, delivery, order_date)
VALUES
    (1, 'Order 1 for User 1', TRUE, '2024-03-25 12:00:00'), -- Заказ на первый адрес
    (1, 'Order 2 for User 1', FALSE, '2024-03-26 12:30:00'),
    (1, 'Order 3 for User 1', TRUE, '2024-03-26 15:45:00'), -- Заказ на второй адрес
    (2, 'Order 1 for User 2', FALSE, '2024-03-26 12:00:00'),
    (2, 'Order 2 for User 2', FALSE, '2024-03-26 12:00:00'),
    (2, 'Order 3 for User 2', FALSE, CURRENT_TIME),
    (3, 'Order 1 for User 3', TRUE, CURRENT_TIME),
    (3, 'Order 2 for User 3', TRUE, CURRENT_TIME),
    (3, 'Order 3 for User 3', FALSE, CURRENT_TIME),
    (4, 'Order 1 for User 4', FALSE, CURRENT_TIME),
    (4, 'Order 2 for User 4', FALSE, CURRENT_TIME),
    (4, 'Order 3 for User 4', FALSE, CURRENT_TIME),
    (5, 'Order 1 for User 5', TRUE, CURRENT_TIME),
    (5, 'Order 2 for User 5', TRUE, CURRENT_TIME),
    (5, 'Order 3 for User 5', FALSE, CURRENT_TIME),
    (6, 'Order 1 for User 6', FALSE, CURRENT_TIME),
    (7, 'Order 1 for User 7', FALSE, CURRENT_TIME),
    (8, 'Order 1 for User 8', FALSE, CURRENT_TIME),
    (9, 'Order 1 for User 9', TRUE, CURRENT_TIME),
    (10, 'Order 1 for User 10', FALSE, CURRENT_TIME);

INSERT INTO sutk.step_names (name)
VALUES
    ('Проверка заказа'),
    ('Ожидание оплаты'),
    ('Сбор заказа'),
    ('Доставка'),
    ('Самовывоз');

INSERT INTO sutk.steps (worker_id, order_id, step_id, from_date, to_date)
VALUES
    (5, 1, 1, '2024-03-25', '2024-03-26'),
    (8, 1, 2, '2024-03-26', '2024-03-27'),
    (9, 1, 3, '2024-03-28', '2024-03-29'),
    (10, 1, 4, '2024-03-29', NULL), -- Заказ в доставке и не доставлен

    (7, 2, 1, '2024-03-26', '2024-03-26'),
    (8, 2, 2, '2024-03-26', '2024-03-27'),
    (9, 2, 3, '2024-03-27', '2024-03-28'),
    (10, 2, 5, '2024-03-28', NULL), -- Заказ в самовывозе и не забран

    (7, 3, 1, '2024-03-26', '2024-03-26'),
    (8, 3, 2, '2024-03-26', '2024-03-27'),
    (9, 3, 3, '2024-03-27', '2024-03-28'),
    (10, 3, 4, '2024-03-28', '2024-03-29'), -- Заказ в доставке и доставлен

    (7, 4, 1, '2024-03-26', '2024-03-26'),
    (8, 4, 2, '2024-03-26', '2024-03-27'),
    (9, 4, 3, '2024-03-27', '2024-03-28'),
    (10, 4, 5, '2024-03-28', '2024-03-29'), -- Заказ в самовывозе и забран

    (6, 5, 1, '2024-03-26', '2024-03-27'),
    (4, 5, 2, '2024-03-27', '2024-03-28'),
    (9, 5, 3, '2024-03-28', NULL),
    (2, 6, 1, CURRENT_DATE, NULL),
    (3, 7, 1, CURRENT_DATE, NULL),
    (5, 8, 1, CURRENT_DATE, NULL),
    (8, 9, 1, CURRENT_DATE, NULL),
    (2, 10, 1, CURRENT_DATE, NULL),
    (3, 11, 1, CURRENT_DATE, NULL),
    (5, 12, 1, CURRENT_DATE, NULL),
    (8, 13, 1, CURRENT_DATE, NULL),
    (7, 14, 1, CURRENT_DATE, NULL),
    (2, 15, 1, CURRENT_DATE, NULL),
    (3, 16, 1, CURRENT_DATE, NULL),
    (5, 17, 1, CURRENT_DATE, NULL),
    (8, 18, 1, CURRENT_DATE, NULL),
    (7, 19, 1, CURRENT_DATE, NULL),
    (2, 20, 1, CURRENT_DATE, NULL);

INSERT INTO sutk.products (name, quality, description, price, available, weight)
VALUES
    ('Лист горячекатаный', 'ГОСТ 14637-89', 'Лист горячекатаный из углеродистой стали', 15000.99, 100, 0.052),
    ('Уголок стальной', 'ГОСТ 8509-93', 'Уголок стальной для различных конструкций', 7550.5, 80, 0.031),
    ('Труба квадратная', 'ГОСТ 8639-82', 'Профильная труба квадратного сечения', 2008.5, 50, 0.038),
    ('Балка двутавровая', 'ГОСТ 8239-89', 'Двутавровая балка из углеродистой стали', 30025.5, 40, 0.051),
    ('Проволока сварочная', 'ГОСТ 2246-70', 'Проволока для сварки различных металлических конструкций', 5030, 120, 0.040),
    ('Лист оцинкованный', 'ГОСТ 14918-80', 'Лист оцинкованный для защиты металлических поверхностей', 18090, 60, 0.061),
    ('Труба круглая', 'ГОСТ 8732-78', 'Труба круглого сечения для различных инженерных целей', 22040, 70, 0.102),
    ('Швеллер гнутый', 'ГОСТ 8240-97', 'Швеллер для создания каркасов и несущих конструкций', 12075, 90, 0.013),
    ('Полоса стальная', 'ГОСТ 103-76', 'Полоса стальная для различных видов обработки', 7060, 110, 0.010),
    ('Арматура строительная', 'ГОСТ 5781-82', 'Арматура изготовленная согласно стандарту ГОСТ', 9020, 100, 0.012),
    ('Труба прямоугольная', 'ГОСТ 8645-68', 'Прямоугольная труба для строительства и машиностроения', 25060, 60, 0.011),
    ('Уголок нержавеющий', 'ГОСТ 8567-93', 'Уголок из нержавеющей стали', 15080, 80, 0.025),
    ('Лента прокатанная', 'ГОСТ 2284-79', 'Лента прокатанная для облицовки и отделки', 8090, 120, 0.041),
    ('Труба электросварная', 'ГОСТ 10706-76', 'Труба электросварная для транспортировки жидкостей и газов', 19030, 50, 0.063),
    ('Полоса нержавеющая', 'ГОСТ 103-2006', 'Полоса нержавеющая для промышленного использования', 11050, 90, 0.031),
    ('Сталь круглая', 'ГОСТ 2590-88', 'Пруток круглого сечения из углеродистой стали', 16070, 70, 0.01),
    ('Уголок гнутый', 'ГОСТ 8509-93', 'Угловой профиль для строительства и декоративных элементов', 7040, 100, 0.028),
    ('Швеллер гнутый', 'ГОСТ 8240-97', 'Швеллер для создания каркасов и несущих конструкций', 13025, 80, 0.015),
    ('Проволока горячекатаная', 'ГОСТ 7372-79', 'Проволока для изготовления сеток и крепежных элементов', 6030, 110, 0.012),
    ('Стальной штампованный лист', 'ГОСТ 19904-83', 'Лист стальной полученный методом штамповки', 20090, 70, 0.015),
    ('Труба спирально-навивная', 'ГОСТ 20295-85', 'Труба спирально-навивная для транспортировки продуктов', 24040, 50, 0.056),
    ('Полоса оцинкованная', 'ГОСТ 14918-80', 'Полоса оцинкованная для различного применения', 9060, 100, 0.020),
    ('Уголок широкополочный', 'ГОСТ 8509-93', 'Уголок широкополочный для инженерных конструкций', 8070, 90, 0.015),
    ('Труба оцинкованная', 'ГОСТ 3262-75', 'Труба оцинкованная для водопровода и отопления', 21080, 40, 0.073),
    ('Проволока нержавеющая', 'ГОСТ 18143-72', 'Проволока из нержавеющей стали', 12050, 110, 0.101);

INSERT INTO sutk.ordered_products (order_id, product_id, count)
VALUES
    (1, 3, 10), -- Заказ 1: Труба x10
    (1, 5, 20), -- Заказ 1: Проволока x20
    (2, 10, 15), -- Заказ 2: Арматура x15
    (2, 20, 4), -- Заказ 2: Стальной лист x4
    (2, 22, 12), -- Заказ 2: Полоса x12
    (3, 17, 5), -- Заказ 3: Уголок x5
    (3, 20, 5), -- Заказ 3: Стальной лист x5
    (4, 8, 8), -- Заказ 4: Швеллер x8
    (4, 22, 12), -- Заказ 4: Полоса x12
    (5, 6, 7), -- Заказ 5: Лист x7
    (6, 13, 15), -- Заказ 6: Лента x15
    (7, 14, 10), -- Заказ 7: Труба x10
    (8, 1, 5), -- Заказ 8: Лист x5
    (8, 19, 7), -- Заказ 8: Проволока x7
    (9, 11, 12), -- Заказ 9: Труба x12
    (10, 21, 8), -- Заказ 10: Труба x8
    (11, 16, 10), -- ...
    (12, 15, 6),
    (13, 20, 4),
    (13, 23, 5),
    (14, 12, 9),
    (15, 7, 6),
    (15, 25, 8),
    (16, 22, 12),
    (17, 6, 10),
    (18, 13, 15),
    (19, 14, 2),
    (20, 1, 8);